Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: བྱ་བ་ལས་དང་ཡོན་ཏན་ཉིད། །ཡང་དག་ལྡན་པ་སྒྲུབ་པར་འགྱུར། །
en: “One who possesses the karmic qualities For performing rituals will succeed.

source: ཆོ་ག་སྔོན་འགྲོ་བྱ་བའི་ལས། །སྟོབས་བཅུ་ལྡན་པས་སྔོན་བསྟན་ཏོ། །
en: Such ritual activities, along with their procedures, Have been formerly taught by those with the ten powers. {15.91}

source: རྫས་དང་སེམས་ཅན་སྤྱོད་པ་གཞན། །བྱ་བ་ལས་དང་ཡོན་ཏན་ཡིན། །
en: “The karmic qualities for [performing specific] rites Are indicated by the beings’ behavioral tendencies.

source: རྣམ་པ་སྣ་ཚོགས་རྨི་ལམ་ཚུལ། །ལས་ལས་འབྱུང་བར་སྣང་བ་ཡིན། །
en: The different forms they see in dreams are regarded, similarly, As the products of their karmic activities. {15.92}

source: དེ་བས་རྨི་ལམ་མཚན་མ་ཡིས། །རྒྱ་ཆེ་ལས་ལ་རབ་སྦྱར་བྱ། །
en: “Thus, based on the signs received in dreams, One can determine the full range of activities to engage in.

source: རྣམ་པ་སྣ་ཚོགས་རྣམ་པ་དང་། །ཡིད་འོང་བལྟ་ན་སྡུག་པ་དང་། །
en: Signs of different forms, Some pleasing and nice to look at, {15.93}

source: བགེགས་ཀྱི་གཟུགས་དང་གཟུགས་མེད་པ། །རྨི་ལམ་རྒྱུར་ནི་སྣང་བ་ཡིན། །
en: “Others ugly, or with forms of obstacles, Will appear in dreams.

source: མཐུ་ཆེ་སྤྲོ་བ་ཆེ་བ་ནི། །མི་ནི་གྲུབ་པ་འདོད་པ་ཡིན། །
en: People who desire accomplishments Should be very enthusiastic and diligent. {15.94}

source: མཆོག་དང་ཐ་མ་འབྲིང་དག་ནི། །དེ་དག་ལ་ནི་གྲུབ་པར་བརྟག །
en: “The accomplishments will come to them In terms of being of the highest, medium, or lowest range.

source: དྲག་ཅིང་མ་རུངས་ལས་རྣམས་ནི། །རྨི་ལམ་རྟག་ཏུ་འཕྲལ་དུ་སྨིན། །
en: Activities that are violent and cruel Always bring on dreams immediately [indicative] of the ripening fruits. {15.95}

source: བཟང་པོ་བརྟན་པའི་ལས་དག་ནི། །ཡུན་རིང་དུས་སུ་གྲུབ་ཕྱིར་རོ། །
en: “Regarding the highest, steadfast activities, They will be accomplished after a long time.

source: འཇིག་རྟེན་འཇིག་རྟེན་འདས་རྣམས་ཀྱིས། །ཡོན་ཏན་སྐྱེ་བར་ཡང་དག་འབྱུང་། །
en: Worldly activities of those who are predominantly worldly Will produce [corresponding karmic] qualities. {15.96}

source: རྨི་ལམ་རྣམ་པ་སྣ་ཚོགས་སྣང་། །ཟློས་པས་སྔགས་རྣམས་འགྲུབ་པར་འགྱུར། །
en: “There are many dreams that occur to mantra reciters That indicate their accomplishment of the mantra.

source: མི་འགྲུབ་དོན་དུ་སྔགས་རྣམས་ནི། །གཉིད་དང་སྙོམ་པ་རབ་ཏུ་བརྟག །
en: Lethargic sleep portends that The mantra will not be accomplished. {15.97}

source: བགེགས་འཇོམས་བྱེད་པའི་སྔགས་རྣམས་ནི། །དེ་ཡི་དུས་སུ་རབ་ཏུ་བརྟག །
en: “In that situation it is recommended to recite The mantra that destroys the obstacles.

source: དེ་ཚེ་སྔགས་ནི་རིགས་ཚུལ་གྱིས། །ཟློས་པས་དེ་ཚེ་རབ་ཏུ་སྦྱར། །
en: One should employ at that time A mantra that is appropriate for reciters. {15.98}

source: ཁྲོ་བོ་ཆེན་པོ་ཕྱག་དྲུག་དང་། །ཞལ་དྲུག་ཉིད་དུ་བརྟག་པར་བྱ། །
en: “The prescribed [mantra] is the six-armed And six-faced [Mañjuśrī] Mahākrodha.

source: སྔགས་ཆེན་ཡི་གེ་བཞི་པ་ནི། །གཞོན་ནུའི་གཟུགས་ལ་གནས་པ་ཡིན། །
en: His four-syllable great mantra Resides within his youthful form. {15.99}

source: དྲག་པོའི་གཟུགས་ནི་གཟུགས་ཆེན་པོ། །
en: “He is of a terrible aspect and very frightening,

source: ཕག་གི་རྣམ་པར་ཡང་དག་འབྱུང་། །བགེགས་ཀུན་རྣམ་པར་གཞིག་བྱའི་ཕྱིར། །དུས་མཚན་དེ་ནི་ལྷ་ཡི་རྒྱལ། །
en: Manifesting in a form of a boar In order to destroy the obstacles; Black as night, he is the king of gods. {15.100}

source: སྟག་གི་པགས་པའི་ཤམ་ཐབས་ཅན། །སྦྲུལ་གྱི་གདེངས་ཀ་རྣམ་པར་འཕྱང་། །
en: “He is dressed in a tiger skin And adorned with snakes with expanded hoods.

source: ལག་ན་རལ་གྲི་སེམས་དཔའ་ཆེ། །
en: This great being holds a sword in his hand

source: གཟི་བརྗིད་ཆེན་པོ་གཤིན་རྗེའི་གཟུགས། །
en: And appears in the form of Death of great splendor. {15.101}

source: བགེགས་རྣམས་ཀུན་ལ་གཙེ་བར་བྱེད། །ལོག་འདྲེན་རྣམས་ཀྱི་སྲོག་འཕྲོག་བྱེད། །
en: “He is tough on all obstacle makers And ends the life of vināyakas.

source: འབྱུང་པོ་ཀུན་ནི་རབ་ཉོན་ཅིག །མི་བཟད་སྔགས་ནི་བཤད་པར་བྱ། །
en: Hear, all the beings, his mantra, The fiercest in the tantras. {15.102}

source: ཆོ་འཕྲུལ་ཆེན་པོ་བགེགས་རྣམས་ཀུན། །མ་རུངས་སེམས་ཅན་འཇིག་པར་བྱེད། །
en: “This mantra removes all obstacles From any given being.

source: སྔགས་རྣམས་ཀུན་ནི་སྒྲུབ་བྱེད་པ། །ལྷ་ཡི་ཚོགས་རྣམས་ང་ལ་ཉོན། །
en: It accomplishes all mantras. Assembled gods, hear me! {15.103}

source: ན་མཿས་མནྟ་བུད་དྷཱ་ནཱཾ། ཨ་པྲ་ཏི་ཧ་ཏ་ཤཱ་ས་ནཱ་ནཱཾ། ཏདྱ་ཐཱ། ཧེ་ཧེ་མ་ཧཱ་ཀྲོ་དྷ་ཥ་ཎ་མུ་ཁཱ་ཥྚ་ཙ་ར་ཎ། སརྦ་བིགྷ་ན་བིགྷཱ་ན་གྷཱ་ཏ་ཀ་ཧཱུྃ་ཧཱུྃ། ཀིཉྩི་ར་ཡ་སི་བི་ནཱ་ཡ་ཀ་ཛཱི་བི་ཏཱནྟ་ཀ་རདུཿསྭཱ་བྣཾ་མེ་ནཱ་ཤ་ཡ། ལ་ཧུ་ལ་ཧུ་ས་མ་ཡ་མ་ནུ་སྨ་ར་ཕཊ་ཕཊ་སྭཱ་ཧཱ།
en: “Homage to all the buddhas, the perfect teachers! The mantra is: “ He he, Mahā­krodha ! The six-faced, six-legged destroyer of all obstacles, hūṁ hūṁ ! Why do you tarry? O destroyer of the life of vināyakas, destroy my bad dreams! Lunge forward, lunge! Remember your pledge! Phaṭ phaṭ, svāhā!” {15.104}

source: ཁྲོ་བོའི་རྒྱལ་པོ་ཆེན་པོས་འདི་གསུངས་མ་ཐག་ཏུ་བགེགས་དང་ལོག་འདྲེན་ཐམས་ཅད་འཇིགས་ཤིང་ཉམ་ཐག་ནས།
en: As soon as this king, the Lord of Wrath, was pronounced, all the vināyakas and obstructers became disturbed and frightened.

source: སྙིང་གས་ཏེ་ཡིད་ཤིན་ཏུ་སྐྲག་ནས། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཕྱག་འཚལ་བར་བྱེད་ཅིང་དམ་ཚིག་ལ་གནས་པར་གྱུར་ཏོ། །
en: With fainting hearts and panicked minds, they paid homage to Lord Śākyamuni and Mañjuśrī, the divine youth, and remained samaya-bound to them. {15.105}

source: དེ་ནས་བཅོམ་འདས་ཤཱཀྱ་ཐུབ་པས་ཐམས་ཅད་དང་ལྡན་པའི་གནས་གཙང་མའི་གཞལ་མེད་ཁང་ལ་གཟིགས་ནས། འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Lord Śākyamuni then looked at the entire realm of the Pure Abode, and said this to the great assembly of his followers:

source: ཀྱེ་ཀྱེ་ལྷའི་ཚོགས་ཆེན་པོ་དག་ཁྲོ་བོའི་རྒྱལ་པོ་འདི་ནི།
en: “Ho ho, assembly of gods! He is the Lord of Wrath .

source: འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པ་ཐམས་ཅད་ཀྱི་སྔགས་རྣམས་འདོན་པར་བྱེད་པ་ན་གང་ཞིག་མ་རུངས་པའི་སེམས་ཅན་གྱི་གཟུགས་ཅན་གྱིས་རྣམ་པར་འཚེ་བར་བྱེད་པ་དེ་ལ། ཁྲོ་བོའི་རྒྱལ་པོ་འདིས་ནི་རིགས་རྒྱུད་ཐམས་ཅད་འདུལ་བར་བྱེད་ཅིང་། སྲོག་ཀྱང་འཛིན་པར་མི་བྱེད་དེཡོངས་སུ་གདུང་བར་བྱེད་ཅིང་། ཡོངས་སུ་སྐེམ་པར་བྱེད་པའི་རྣམ་པར་གཞག་པར་བྱ་བ་ལ་འཇོག་པར་བྱེད་ཅིང་།
en: While any of the worldly or transcendent mantras are being accomplished, the Lord of Wrath will tame any evil being that causes harm to the reciter, along with the culprit’s family. He will cause them to wither but will not take their lives. Having burnt them and dried them up, he will assign a role to them, appointing them to protect, support, and guard the reciter.

source: ཟློས་པ་དག་ལ་ཡང་སྲུང་བ་དང་སྦ་བ་དང་སྦེད་པ་ལ་གནས་པར་འཇོག་པར་བྱེད་ཅིང་།
en: The being thus appointed will have to sustain the reciter.

source: རྗེས་སུ་འཕེལ་བར་བྱེད་པ་དང་གང་ཞིག་དམ་ཚིག་འདི་ལས་འདའ་བར་བྱེད་པ་དང་ཁྲོ་བོའི་རྒྱལ་པོས་སྒྲུབ་པ་པོ་སྲུང་བར་བྱས་པ་ལ་རྣམ་པར་ཐོ་འཚམ་པར་བྱེད་ནམགོ་བོ་ཨ་རྫ་ཀའི་དོག་པ་བཞིན་དུ་རྣམ་པ་བདུན་དུ་འགས་པར་འགྱུར་རོ། །
en: Any such being who would transgress this obligation and harm the practitioner who is under the protection of the Lord of Wrath {15.106} “Will have his head split into seven pieces by the Lord of Wrath, Like a garland of arjaka tree blossoms.”

source: ཐུབ་པ་མཆོག་གིས་དེ་གསུངས་ནས། །འཇམ་པའི་དབྱངས་ལ་དེ་ཚེ་གསུངས། །
en: Having spoken thus, the foremost one among sages Said this to Mañjughoṣa: {15.107}

source: གཞོན་ནུ་ཁྱོད་ཀྱི་སྔགས་རྣམས་ལ། །མ་ལུས་དོན་ནི་རྒྱ་ཆེན་དོན། །
en: “Divine youth!

source: སྔགས་རྒྱུད་དོན་དང་ལྡན་པ་དང་། །སྒྲུབ་པ་རྣམས་ལ་ཁྱད་པར་དུ། །
en: Your mantras fulfill All aims, the whole range of aims,

source: བགེགས་རྣམས་མ་ལུས་འཇོམས་པ་ཡི། །རྒྱུད་ལ་ཁྲོ་རྒྱལ་བསྟན་པ་ཡིན། །
en: Especially for practitioners who Pursue the aims of the mantra system. {15.108}

source: འཇིག་རྟེན་མགོན་གྱིས་སྔོན་འདི་ནི། །དེ་བཞིན་དུ་ནི་ཡང་དག་སྦྱར། །
en: “This mantra has been taught by the Lord of Wrath in the tantras

source: མ་ལུས་བགེགས་རྣམས་འཇིག་བྱའི་ཕྱིར། །
en: As the one that destroys all obstacles.

source: དགྲ་རྣམས་ཀྱི་ནི་ཁྲོ་བ་སེལ། །
en: And appeasing the anger of enemies.

source: སེམས་ཅན་རྣམས་ནི་སྲུང་དོན་དང་། །རྨི་ལམ་ངན་པ་སེལ་བར་བྱེད། །
en: “It affords protection to sentient beings And destroys bad dreams.

source: སྔགས་རྣམས་མ་ལུས་སྒྲུབ་པ་ལ། །འཇིག་རྟེན་མཆོག་གིས་གསུངས་པ་ཡིན། །
en: It has been taught by the supreme among people, the buddhas, As being able to accomplish the aims of all mantras. {15.111}

source: དེ་ནས་གཞན་ཡང་རབ་བཤད་པ། །སྐྱེས་བུའི་མཚན་ཉིད་བཟང་པོ་ཡིན། །གང་ལ་སྔགས་རྣམས་འགྲུབ་འགྱུར་བ། །མཆོག་དང་ཐ་མ་བར་མ་འོ། །
en: “I will further teach The auspicious characteristics of men For whom the mantras are successful— Those of the highest, medium, and the lowest types. {15.112}

source: གཟི་བརྗིད་ལྡན་དང་ཤེས་ལྡན་དང་། །གསེར་མདོག་གསུས་པ་ཆེ་བ་དང་། །དཀྱུས་རིང་མིག་དང་སྣུམ་པ་དང་། །ཆགས་ཆུང་ཁྲོ་བ་རྣམ་པར་སྤངས། །
en: “One who is energetic and intelligent; Has a golden complexion, a large belly, Elongated eyes, and smooth skin; Is dispassionate and free of anger; {15.113}

source: མིག་མཐའ་དམར་ཞིང་སྙན་པར་སྨྲ། །དེ་ལ་གྲུབ་པ་མཆོག་ཏུ་འགྱུར། །
en: “Has red eye-corners and speaks nicely, For him accomplishment is of the highest type.

source: པགས་པ་སྲབ་ཅིང་སྔོ་བསངས་མདོག །ཧ་ཅང་རིང་མིན་ཡན་ལག་ཕྲ། །
en: One with delicate skin, a dark complexion, And slim limbs that are not too long; {15.114}

source: སྤྲོ་བ་ཆེ་ཞིང་གཟི་བརྗིད་ཆེ། །ཆོག་ཤེས་ཀུན་ནས་དགེ་བ་བྱེད། །
en: “Who is full of enthusiasm and energy, Content, virtuous in every respect,

source: སྐྱེ་གནས་བཟང་པོ་དག་པ་དང་། །འདོད་པ་ཆུང་ཞིང་ཅུང་ཟད་དགེ། །
en: And pure on the account of his high birth; Who has few desires, and is of weak constitution, {15.115}

source: ལས་རྣམས་ཀུན་དུ་སྣང་བ་ནི། །དེ་ལ་ངེས་པར་གྲུབ་པ་མཆོག །
en: “His accomplishment is certain— It will be of the highest kind in all activities.

source: ཡན་ལག་ཐམས་ཅད་མ་ཚང་མེད། །
en: One whose body is not in any way inferior;

source: དཱུར་བ་སྔོ་སངས་གཟི་བརྗིད་ཆེ། །
en: Who is dark as panic grass, full of vigor, {15.116}

source: ཉོན་མོངས་མེད་སེམས་ཤེས་པ་ཅན། །རྟག་ཏུ་གཙང་ཞིང་ཚངས་པར་སྤྱོད། །
en: “Untroubled in mind, intelligent, Always celibate and pure,

source: ཕྲ་བའི་གོས་ལ་རྟག་ཏུ་དགའ། །
en: And always fond of fine clothes;

source: ཆོས་ཀྱི་ངང་ཚུལ་འཇིག་རྟེན་ཤེས། །
en: Who knows the ways of the world, is disciplined, {15.117}

source: གྲོགས་མང་རྟག་ཏུ་གཏོང་བ་དང་། །ཟས་ཚོད་རིག་དག་རྟག་གཙང་ལྡན། །
en: “Has many friends, is always detached, And eats moderately;

source: ཤེས་ཉེན་ཚུལ་ཁྲིམས་སྤྱོད་པ་དང་། །གཙང་བའི་སྤྱོད་ལ་རྟག་ཏུ་དགའ། །
en: And who is pure, skilled, and moral, Always enjoys pure conduct, {15.118}

source: བདེན་པར་སྨྲ་ཞིང་སྙིང་རྗེ་ཅན། །དེ་ལ་གྲུབ་པ་མཆོག་ཏུ་འགྱུར། །
en: “Speaks the truth, and is compassionate Will reach the highest type of accomplishment.

source: ཡོན་ཏན་རྒྱ་ཆེ་ཡན་ལག་ཚང་། །རིགས་ལྡན་རྟག་ཏུ་ཆོས་དང་ལྡན། །
en: One not missing any limbs, full of qualities, Born to a good family, always adhering to the Dharma, {15.119}

source: མ་དང་ཕ་ལ་གུས་པ་དང་། །བྲམ་ཟེ་ལ་ནི་མཆོད་པ་བྱེད། །
en: “Devoted to his mother and father, Reverential toward brahmins and guests,

source: ཤིན་ཏུ་སྙིང་རྗེ་ལྡན་ཞིང་བརྟན། །དེ་ལའང་གྲུབ་པ་མཆོག་ཏུ་འགྱུར། །
en: Very compassionate, and steadfast Will reach the highest type of accomplishment. {15.120}

source: སྔོ་སངས་དཀར་དང་སྣུམ་པ་དང་། །རྟག་ཏུ་གཙང་ཞིང་ཉུང་ངུ་སྨྲ། །
en: “One of pure, dark complexion and smooth skin, Who speaks little and always remains pure,

source: བསོད་པའི་ཁ་ཟས་ལ་དགའ་ཞིང་། །གཙང་བའི་སྤྱོད་པས་མངོན་པར་འགྲོ། །
en: Wants only the food and drink that are pure, Has sex only with pure partners, {15.121}

source: མང་འདོད་སེམས་ཅན་འཇིག་རྟེན་ཤིས། །དེ་ལའང་གྲུབ་པ་མཆོག་ཏུ་འགྱུར། །
en: “Knows the ways of the world, and is highly respected Will reach the highest type of accomplishment.

source: ཧ་ཅང་མི་ཐུང་རིང་བའང་མིན། །སྐུ་ནི་མིག་སྨན་བཞིན་དུ་གནག །
en: One who is neither too short nor too tall, Has hair as black as antimony powder, {15.122}

source: མིག་དང་མིག་འབྲས་རབ་ཏུ་སྣུམ། །གཙང་ཞིང་རྟག་ཏུ་ཁྲུས་ལ་དགའ། །
en: “Has loving eyes, is pure, Always enjoys bathing,

source: དཀོན་མཆོག་གསུམ་ལ་ཤིན་ཏུ་དད། །དེ་ཡི་གྲུབ་པ་མཆོག་ཏུ་འགྱུར། །
en: And is propitiatory toward the Three Jewels Will reach the highest type of accomplishment. {15.123}

source: མཆོག་གི་ལས་ནི་རབ་སྟོན་ཅིང་། །སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཤེས། །
en: “One who engages in noble activities, Who is a refuge to sentient beings and knows their minds,

source: བཟོད་ལྡན་སྙན་པར་སྨྲ་བ་དང་། །རྒྱལ་བའི་སྲས་ལ་རབ་ཏུ་དགའ། །
en: And who is forbearing, polite in speech, And reverent toward bodhisattvas—

source: དེ་ཚེ་འཇིག་རྟེན་འདས་པ་གྲུབ། །དེ་ལ་འབྲས་བཅས་གྲུབ་པར་འགྱུར། །
en: He will reach a supramundane accomplishment That is rich in results. {15.124}

source: སེམས་དཔའ་ཆེ་ཞིང་བརྩོན་འགྲུས་ཆེ། །གཟི་བརྗིད་ཆེ་ཞིང་བརྟུལ་ཞུགས་ཆེ། །
en: “One who is very honest, heroic, And full of vigor; who has undertaken solemn vows;

source: ལོངས་སྤྱོད་ཆེ་ཞིང་སྔགས་རྣམས་ཤེས། །
en: Who is endowed with good fortune, knows the mantras,

source: སྔགས་རྣམས་ཀུན་ལ་དེ་ཉིད་རིག །
en: And understands the essence of all the tantras; {15.125}

source: རིགས་ཀྱི་མཆོག་ནི་རྒྱལ་རིགས་སམ། །བྲམ་ཟེ་ཤེས་དང་ལྡན་པ་དང་། །
en: “Who belongs to the kṣatriya caste Or is an exemplary brahmin; who is intelligent,

source: བུད་མེད་ལ་བརྟེན་དེ་ལ་ཆགས། །དེ་བཞིན་གསེར་གྱི་མདོག་དང་ལྡན། །
en: Cavorts with women, is always passionate, Has a golden complexion, {15.126}

source: བོང་ཚོད་ཆེ་ཞིང་དཀར་བ་དང་། །སྣ་ནི་མཐོ་ཞིང་ལག་པ་ཆེ། །དཔའ་ཞིང་ལག་པ་རིང་བ་དང་། །རྒྱལ་པོ་ཆེ་ལ་མངོན་པར་འདོད། །
en: “Appears tall and fair skinned, And has a long nose, big arms, And dangling forearms; who is valiant, Aspires to rule a great kingdom, {15.127}

source: རྒྱལ་བའི་སྲས་ལ་དད་པ་དང་། །བུད་མེད་མིག་ལྡན་ལྷ་ལ་མཆོད། །
en: “Is reverent toward bodhisattvas, Has a woman’s name, worships goddesses,

source: དཀོན་མཆོག་གསུམ་ལ་གུས་པ་དང་། །བྱང་ཆུབ་སེམས་ཀྱིས་བརྒྱན་པ་ཡིན། །
en: And is devoted to the Three Jewels, Adorned with bodhicitta,

source: ལྷག་པར་སྙིང་རྗེ་བརྟན་པ་དང་། །ཅུང་ཟད་ཁྲོ་ཞིང་ཅུང་ཟད་རྨོངས། །
en: Very compassionate, steadfast, And has a certain amount of anger and ignorance; {15.128}

source: ལོངས་སྤྱོད་ཆེ་ཞིང་གཏོང་བ་ཆེ། །
en: “And who is endowed with good fortune, profoundly detached,

source: གཟི་བརྗིད་ཆེ་ཞིང་ཐུལ་བར་དཀའ། །
en: Of great vigor, difficult to subdue,

source: བུད་མེད་རྣམས་ནི་དགའ་དང་དཔའ། །
en: Beloved by women, and valiant

source: དེ་ཡི་གྲུབ་པའང་མཆོག་ཡིན་ནོ། །
en: Will also win accomplishment of the highest type. {15.129}

source: ཤིན་ཏུ་བཏུང་དང་དགའ་དང་དཔའ། །
en: “One who is valiant, delights in drinking,

source: རྟག་ཏུ་བུད་མེད་ལ་ཆགས་དང་། །
en: Always is in the company of women,

source: གསེར་གྱི་མདོག་དང་བྱིན་པ་ཕྲ། །
en: Is of golden complexion, lives on little food,

source: རྐེད་པ་ཆེ་ཞིང་གཙང་བ་དང་། །
en: Has broad hips, and is pure, {15.130}

source: བརྩེ་དང་སྙིང་རྗེ་ལྡན་མཁས་པ། །
en: “Compassionate, caring, skillful,

source: ཡོན་ཏན་མང་འདོད་འཇིག་རྟེན་ཤེས། །
en: Knowing in the ways of the world, highly esteemed for his qualities,

source: རྟག་ཏུ་སྔགས་རྣམས་ཟློས་ལ་གུས། །
en: Always dedicated to reciting the mantras,

source: རྒྱལ་བ་ལ་ནི་སྲོག་ཀྱང་གཏོང་། །
en: Willing to give up his life for the victorious lords {15.131}

source: དེ་བཞིན་ཉན་ཐོས་སྲས་རྣམས་དང་། །
en: “And also for their sons, the śrāvakas,

source: བསེ་རུ་ལ་ཡང་རྟག་ཏུ་གཏོང་། །
en: As well as to the pratyeka­buddhas;

source: སྟོབས་ལྡན་འཇིག་རྟེན་གཙོ་བོ་དང་། །
en: Who is mighty, eminent among men,

source: རིགས་ནི་གཉིས་པ་བཟང་པོ་ཡིན། །
en: Belongs to the pure second caste, {15.132}

source: མ་རུངས་རྟག་ཏུ་བབ་ཅོལ་བྱེད། །
en: Always cruel and rash,

source: གཏོང་ལྡན་ཚུལ་ལྡན་དགྲ་ལས་རྒྱལ། །
en: Detached, disciplined, victorious over his enemies,

source: ཆོས་དང་ཆོས་མིན་རྣམ་དཔྱོད་བྱེད། །
en: And able to distinguish between virtue and nonvirtue; {15.133}

source: ཧ་ཅང་སྦོམ་མིན་རྗུད་པའང་མིན། །
en: “And who is not too hefty and not too lean,

source: ཧ་ཅང་རིང་མིན་ཐུང་བའང་མིན། །
en: Not too tall and not too short,

source: བར་མའི་མི་ནི་མཆོག་ཡིན་ཏེ། །
en: And preeminent among the average

source: དེ་ཡི་གྲུབ་པ་མཆོག་ཏུ་འགྱུར། །
en: Will attain accomplishment of the highest kind. {15.134}

source: སེན་མོ་ཟངས་མདོག་ལེགས་སྣུམ་དང་། །
en: “One with copper-colored, smooth fingernails,

source: ལག་མཐིལ་དམར་དང་གཙང་བ་དང་། །
en: With the palms of his hands red and clean,

source: རྐང་པའི་མཐའ་དམར་སྣུམ་པ་དང་། །
en: With the extremities of his feet red and smooth,

source: འཁོར་ལོ་སྭ་སྟི་ཀས་བརྒྱན་དང་། །
en: And adorned with circles, swastikas, {15.135}

source: རྒྱལ་མཚན་རྟ་བབས་ཉ་དང་ནི། །
en: “Banners, archways, fish,

source: བ་དན་པདྨ་ཐོ་བ་དང་། །
en: Flags, lotuses, and water lilies

source: མི་གང་རྐང་པ་ལག་པ་ལ། །
en: Visible on his hands and feet—

source: མཚན་ནི་འདི་དག་ཡོད་གྱུར་པ། །དེ་འདྲའི་སྐྱེས་བུ་དམ་པ་ལ། །
en: A person marked with these signs {15.136} “And fitting this description is the most excellent,

source: གྲུབ་པ་མཆོག་ཏུ་བརྟག་པར་བྱ། །
en: And to his lot will fall the best accomplishment.

source: མཆེ་བ་དཀར་ཞིང་བཟང་བ་དང་། །མཐོ་བའི་རི་བོ་དང་འདྲ་དང་། །
en: One with white, cavity-free, And long teeth that resemble mountains;

source: སྣ་བཟང་མཐོ་ཞིང་མིག་དཀྱུས་རིང་། །སྨིན་མ་སྟུག་ཅིང་ཀོས་ཀོ་བཟང་། །
en: {15.137} “With a long nose, elongated eyes, Knitted brow, a beautiful chin,

source: བ་ཡི་རྫི་མ་འཇིག་རྟེན་མཚན། །ནག་པའི་ལྟ་བའི་མིག་འབྲས་མཚན། །
en: Eyelashes distinguished in the world like those of a cow, Black, beautifully outlined eyes, {15.138}

source: དཔྲལ་བའི་དབྱེས་གང་རྒྱ་ཆེ་ཞིང་། །མགོ་བོ་གདུགས་འདྲའི་རྣམ་པ་བཟང་། །མགོ་བོ་གཙུག་ཏོར་འདྲ་བ་དང་། །རྣ་བ་བཟང་བ་དམ་པ་ཡིན། །
en: “A broad forehead, A beautiful head shaped like a parasol Or shaped like a turban, Beautiful ears, {15.139}

source: རྟག་ཏུ་སེང་གེའི་འགྲམ་འདྲ་དང་། །
en: “Jaws shaped like those of a lion,

source: མ་མཆུ་བིམ་པ་སྨིན་འདྲའི་མདོག །
en: Lips the color of ripe bimba fruit,

source: གང་གི་ལྕེ་ནི་རབ་སྣང་བ། །
en: A tongue the color of a lotus petal,

source: པདྨ་འདབ་མ་དམར་འདྲའི་མདོག །
en: An intensely red palate, {15.140}

source: མགྲིན་པ་བུམ་པ་འདྲ་བ་དང་། །
en: “A neck resembling a conch,

source: ཐལ་གོང་རྒྱས་ཤིང་ཡང་དག་འཕགས། །
en: Full, muscular shoulders,

source: མཆན་ཁུང་ཐོང་ཀ་བཟང་བ་མཆོག །
en: Exquisitely beautiful flanks and bosom,

source: དེ་བཞིན་བརླ་ནི་རྒྱ་ཆེ་དང་། །
en: A broad chest, {15.141}

source: ལྟེ་བའི་ཕྱོགས་ཀྱང་ཆུང་བ་དང་། །
en: “A slim torso,

source: རྐེད་པ་རྒྱ་ཆེ་བཟང་བ་དང་། །
en: Broad, beautiful hips,

source: ལྟེ་བ་ཟབ་ཅིང་གཡས་སུ་འཁྱིལ། །
en: A deep navel with hair curling to the right,

source: ཀུན་ནས་དཀར་མེད་བ་སྤུ་དང་། །
en: A network of straight veins, {15.142}

source: ལག་རིང་ལག་ནི་ཆེ་བ་དང་། །
en: “Dangling forearms, and big arms and hips;

source: རྐེད་པ་སེང་གེ་འདྲ་བའི་མཚན། །
en: Who is distinguished by a lion’s chest,

source: གང་གི་བརླ་ནི་ཟླུམ་པ་དང་། །
en: Has round thighs,

source: གྲུ་མོ་ཉམས་མེད་ཟླུམ་པ་དང་། །
en: And elbows free of blemish; {15.143}

source: བྱིན་པ་ཨེ་ན་ཡ་ལྟ་བུར། །ཟླུམ་པའི་ནང་ནི་ཟླུམ་པོར་གྲུབ། །
en: “Whose calves, like those of an antelope, Are said to be well proportioned and round;

source: རྐང་པ་ཤ་དང་ལྡན་པ་དང་། །སོར་མོ་རྣམས་ཀྱི་རིང་བ་དང་། །དམར་ཞིང་སེན་དམར་སྣུམ་པ་དང་། །ཤ་རྒྱས་པས་ནི་སྣུམ་པ་ཡིན། །
en: Who has fleshy feet With red, upraised toes {15.144} “With red, smooth toenails— Feet that are nicely arched and adorned with flesh;

source: ནང་སྟོང་མ་ཡིན་མཐིལ་མཉམ་གནས། །དགེ་ཞིང་མཐོང་ན་དགའ་བ་དང་། །འཇམ་ཞིང་ཁ་དོག་དག་པ་དང་། །
en: Whose head . . . the surface of the earth; Who has beautiful ears, nice to behold, {15.145} “Smooth, of nice color, clean,

source: རབ་བསྔགས་འཇིག་རྟེན་བཀྲ་ཤིས་དང་། །དེ་དག་གི་ནི་སྟེང་དག་ཏུ། །རྩ་ཡི་དྲ་བ་མངོན་པ་མེད། །
en: Praiseworthy and distinguished in the world, Above which there is a network of veins That are not bulging;

source: བཤང་བ་འབྱུང་བའི་ལམ་དག་ཏུ། །རི་མོ་ཟབ་ཅིང་གཡས་སུ་འཁྱིལ། །
en: {15.146} “Whose two pathways for voiding excreta Are deep and turn toward the right;

source: མཆིག་པ་རབ་བསྔགས་ཤིན་ཏུ་ཆུད། །རྟག་ཏུ་ཟླུམ་ཞིང་དགེ་བ་ཡིན། །
en: Who has two fine testicles, Small, round, beautiful, {15.147}

source: མ་འབྲེལ་དུམ་བུ་མ་ཡིན་དང་། །གཅིག་མིན་ཉིད་དུ་བསྟན་པ་ཡིན། །
en: “Without injuries or cracks, And nicely separated;

source: གང་ཚེ་སྐྱེས་དབང་གཙང་བ་དང་། །རྩེ་མོ་དམར་ལ་ཡང་དག་གནས། །
en: Whose member becomes drawn in After voiding the bodily fluid at the end of physical passion; {15.148}

source: སྐྱེ་བོ་ཉལ་ཁར་ཁ་ཟས་ནི། །རོ་ནི་རྩ་བར་བྱེད་པ་ཟ། །བཤང་བ་ཁ་དོག་སྔོ་བ་འམ། །གལ་ཏེ་དམར་པོར་རབ་སྣང་ཞིང་། །
en: “Who, during sleep, after the eating of Aphrodisiacs contained in food or drink, Profusely releases a fluid That appears blue or red; {15.149}

source: མང་པོ་མ་ཡིན་སྣུམ་པ་དང་། །དགེ་བའི་མཚན་གྱི་རབ་མཚན་པ། །དེ་ལྟའི་སེམས་ཅན་གང་ཡིན་པ། །གྲུབ་པ་མཆོག་ཏུ་འདོད་པ་ཡིན། །
en: “And whose [penis] releases much fluid, is smooth, And is marked with signs of beauty— The person of this kind Will attain the highest accomplishment. {15.150}

source: ལན་གསུམ་བཤང་ཞིང་སྔགས་དྲུག་དྲན། །གཙང་སྦྲའི་སྤྱོད་དགའ་ཡོངས་སུ་གཙང་། །གང་ཞིག་ཐུན་ནི་ཐ་མར་ཉལ། །ཐོ་རངས་ལྡང་བའི་སྐྱེ་བོ་རྣམས། །དེ་ཡི་གྲུབ་པ་རྟག་ཏུ་མཆོག །ལས་ཀུན་བྱེད་པར་སྣང་བ་ཡིན། །
en: “One who defecates three times and urinates six times [a day ], Is pure and enjoys performing purificatory observances, Goes to bed at the end of the watch, And gets up early Will attain the highest accomplishment With regard to all activities. {15.151}

source: འབྲས་བུ་རྣམ་པ་སྣ་ཚོགས་དང་། །ཕུན་ཚོགས་རྣམ་པ་མང་པོ་ལ། །མི་རྣམས་རྗེས་སུ་འདོད་པ་ཡང་། །མཚན་ཉིད་ཀྱིས་ནི་མངོན་མཚན་པའོ། །
en: “One will enjoy A variety of results And great prosperity again and again. One is marked with medium characteristics,

source: རྒྱུ་སྐར་དག་ལའང་སྐྱེས་པ་ནི། །རྒྱལ་དང་ནམ་གྲུ་གྲེད་བོ་དང་། །མཆུ་དང་ལྷ་མཚམས་དག་དང་ནི། །ནག་པ་སྣར་མ་སྨིན་དྲུག་དང་། །ནུས་པའི་གཟའ་རྣམས་ཀྱིས་མཚན་པ། །དེ་དག་ལ་ནི་སྐྱེས་མཐོང་དང་། །ཉི་མའི་དཀྱིལ་འཁོར་འཆར་ཁ་ནི། །ཐོ་རངས་དུས་སུ་གང་སྐྱེས་དང་། །གང་ཚེ་དེ་ཡི་དུས་སུ་སྐྱེས། །དེ་ལ་གྲུབ་པ་རབ་ཏུ་སྣང་། །
en: If one is born in the asterisms Of Puṣya, Revatī, Phalgunī, {15.152} “Maghā, Anurādhā, Citrā, Rohiṇī, or Kṛttikā. One born in them is handsome, And marked by the planets as capable. One that was [born under the aforementioned stars] at dawn Will manifest accomplishment. {15.153}

source: ཉིན་ཕྱེད་དང་ནི་ཐོ་རངས་དང་། །ཉི་མའི་མཐར་ཡང་གཟའ་བཟང་པོ། །དཀར་བ་ཟླ་བ་པ་ཝ་སངས། །སེར་བ་གཟའ་ལྷག་ཕུར་བུ་ཡིན། །སྐྱེ་བོ་རྣམས་ཀྱིས་མཐོང་ན་ནི། །འབྲས་བུ་འགྲུབ་ཕྱིར་ནུས་པ་ཡིན། །
en: “If the auspicious planets— The pure white moon, The yellow Mercury, and Jupiter— Are observed at the end of the day, at midday, or at dawn, They indicate, for all people born at that time, That they will be fit for attaining accomplishment. {15.154}

source: མི་ནི་གང་ཞིག་དགེ་ལས་ཀྱིས། །འདི་ལ་སྐྱེས་པར་གྱུར་པ་ཡི། །སྔགས་དོན་མ་ལུས་སྒྲུབ་པ་ལ། །དེ་དག་འབད་མེད་འགྲུབ་པར་འགྱུར། །
en: “If people born in such periods Engage in virtuous activities, Their mantras will easily succeed In accomplishing all their aims. {15.155}

source: ཉི་མ་ཕྱེད་ནི་འདས་པ་དང་། །རྟག་ཏུ་ཉི་མ་ནུབ་པ་ན། །ལུས་ཅན་རྣམས་ཀྱི་རྟག་དེ་ལ། །མ་རུངས་གཟའ་མཐོང་གང་ཡིན་པ། །
en: “After noon has passed And always when the sun is setting— Always during these periods— Planets exercise cruel influence upon beings. {15.156}

source: མ་རུངས་ཉི་མ་མིག་དམར་དང་། །མཇུག་རིངས་སྒྲ་གཅན་སྤེན་པ་དང་། །གང་ཡང་གཟའ་ནི་གཙོ་བོ་དང་། །ལས་ནི་ངན་འཇོམས་སྐར་མདའ་ཅན། །
en: “Sun and Mars are, [at that time], inauspicious, As are comets, Rāhu, and Saturn, The chief among planets, Earthquakes, hurricanes, and meteors. {15.157}

source: སྐར་མ་ཤིན་ཏུ་མི་བཟད་ཉིད། །དེ་བཞིན་ནག་པོ་འཆི་ལྟས་དང་། །དུས་མིན་འཆི་བ་ས་ལ་ནི། །མི་བཟད་དེ་ཚེ་སྣང་བ་ཡིན། །
en: “At that time the stars are very inauspicious. Black omens boding misfortune And fearful portents of death Will appear at that time. {15.158}

source: ཉི་མ་འཆར་བའི་དུས་སུ་ནི། །གཟའ་ལྷག་གིས་ནི་ས་རྣམས་མཐོང་། །གཉའ་ཤིང་གང་ཙམ་ཉི་མས་ཕྱིན། །ཕུར་བུས་ས་དེ་མཐོང་བར་འགྱུར། །
en: “If, at the time of the sun’s rising, Mercury looks upon Earth; If at a yoke’s distance from the sun, Jupiter looks upon Earth; {15.159}

source: དེ་ནས་ཕ་རོལ་གཉའ་ཤིང་ཙམ། །པ་སངས་ནོར་སྤྱན་གྱིས་དེ་མཐོང་། །ཉི་མ་ཕྱེད་ནི་ཡོངས་རྫོགས་ན། །ཟླ་བས་ལུས་ཅན་མ་ལུས་མཐོང་། །གཟའ་ལྷག་དུས་སུ་རྒྱལ་ཐབས་ཐོབ། །
en: “If Venus, a further yoke’s distance away from the sun, Is looked upon by Kubera; If, at the height of noon, The moon’s aspect affects the beings, {15.160} “Then, respectively, Mercury’s influence will bring kingship;

source: ཕུར་བུས་ནོར་དང་ལོངས་སྤྱོད་བྱེད། །
en: Jupiter will bring wealth and pleasures;

source: པ་སངས་ནོར་ནི་ངེས་སྒྲུབ་དང་། །རྒྱལ་སྲིད་ཚེ་དང་ལོངས་སྤྱོད་ལྡན། །
en: Venus will bring wealth, Kingdom, and pleasures;
